Lab7/src/main/resources/postman.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://calculator.org/">
    <soapenv:Header/>
    <soapenv:Body>
        <web:add>
            <num1>2</num1>
            <num2>10</num2>
        </web:add>
    </soapenv:Body>
</soapenv:Envelope>